[Killed] ConditionalExpression
main/components/Nav/AppNavbar.jsx:12:20
   doLogout,
   currentUrl = window.location.href,
 }) {
-  var oauthLogin = systemInfo?.oauthLogin || "/oauth2/authorization/google";
+  var oauthLogin = false;
   return (
     <>
killedBy: AppNavbar tests when oauthlogin undefined, default value is used
statusReason: expect(element).toHaveAttribute("href", "/oauth2/authorization/google") // element.getAttribute("href") === "/oauth2/authorization/google"

Expected the element to have attribute:
  href="/oauth2/authorization/google"
Received:
  null
