[Killed] StringLiteral
main/components/Reviews/ReviewsTable.jsx:90:64
   ];
 
   if (userOptions) {
-    columns.push(ButtonColumn("Edit", "primary", editCallback, "Reviewstable"));
+    columns.push(ButtonColumn("Edit", "primary", editCallback, ""));
     columns.push(
       ButtonColumn("Delete", "danger", deleteCallback, "Reviewstable"),
killedBy: ReviewsTable tests Regular user buttons appear and work properly
statusReason: Unable to find an element by: [data-testid="Reviewstable-cell-row-0-col-Edit-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
