[Killed] BlockStatement
main/components/Reviews/ReviewsTable.jsx:106:29
     );
   }
 
-  if (showModerationStatus) {
-    const statusColumn = {
-      Header: "Status",
-      accessor: "status",
-    };
-    columns.push(statusColumn);
-  }
+  if (showModerationStatus) {}
   return <OurTable data={reviews} columns={columns} testid={"Reviewstable"} />;
 }
killedBy: ReviewsTable tests Status column shows properly when showModerationStatus prop is true
statusReason: Unable to find an element with the text: Status. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
