[Killed] EqualityOperator
main/components/DiningCommons/DiningCommonsTable.jsx:23:7
   );
 
   // Stryker disable OptionalChaining
-  if (error?.response?.status === 500) return <span>no meals offered</span>;
+  if (error?.response?.status !== 500) return <span>no meals offered</span>;
   if (status === "loading") return <span>Loading...</span>;
 
killedBy: DiningCommonsTable tests Meals Offered Today shows 'no meals offered' for 500 error
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  no meals offered
Received:
  An error has occured.

Ignored nodes: comments, script, style

[Killed] ConditionalExpression
main/components/DiningCommons/DiningCommonsTable.jsx:24:7
 
   // Stryker disable OptionalChaining
   if (error?.response?.status === 500) return <span>no meals offered</span>;
-  if (status === "loading") return <span>Loading...</span>;
+  if (false) return <span>Loading...</span>;
 
   if (meals) {
killedBy: DiningCommonsTable tests indicate when loading when loading API
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  Loading...
Received:
  An error has occured.

Ignored nodes: comments, script, style

[Killed] ArrowFunction
main/components/DiningCommons/DiningCommonsTable.jsx:29:20
   if (meals) {
     return (
       <>
-        {meals.map((meal, index) => (
-          <React.Fragment key={meal.code}>
-            {index > 0 && " "}
-            <Link to={`/diningcommons/${date}/${diningHall}/${meal.code}`}>
-              {meal.name}
-            </Link>
-          </React.Fragment> // we have two siblings (" " and link) so a fragment is needed to wrap them together
-        ))}
+        {meals.map(() => undefined)}
       </> // this is also a fragment wrapper, but with no key since we're not inside of a list
     ); // https://react.dev/reference/react/Fragment#rendering-a-list-of-fragments
killedBy: DiningCommonsTable tests Meals Offered Today shows links for success
statusReason: expected '' to be 'Breakfast Lunch Dinner' // Object.is equality

[Killed] ConditionalExpression
main/components/DiningCommons/DiningCommonsTable.jsx:31:14
       <>
         {meals.map((meal, index) => (
           <React.Fragment key={meal.code}>
-            {index > 0 && " "}
+            {true && " "}
             <Link to={`/diningcommons/${date}/${diningHall}/${meal.code}`}>
               {meal.name}
killedBy: DiningCommonsTable tests Meals Offered Today shows links for success
statusReason: expected ' Breakfast Lunch Dinner' to be 'Breakfast Lunch Dinner' // Object.is equality

[Killed] ObjectLiteral
main/components/DiningCommons/DiningCommonsTable.jsx:58:5
       Header: "Name",
       accessor: "name",
     },
-    {
-      Header: "Meals Offered Today",
-      accessor: "code",
-      id: "mealsOfferedToday", // by default the id is the accessor, but since our first column has the same accessor we need a different id here
-      Cell: ({ value }) => <MealsOfferedCell date={date} diningHall={value} />,
-    },
+    {},
     {
       Header: "Has Dining Cam",
killedBy: DiningCommonsTable tests Checkmark / X for Boolean columns shows up as expected, url shows up correctly
statusReason: A column ID (or string accessor) is required!

[Killed] ArrowFunction
main/components/DiningCommons/DiningCommonsTable.jsx:62:13
       Header: "Meals Offered Today",
       accessor: "code",
       id: "mealsOfferedToday", // by default the id is the accessor, but since our first column has the same accessor we need a different id here
-      Cell: ({ value }) => <MealsOfferedCell date={date} diningHall={value} />,
+      Cell: () => undefined,
     },
     {
killedBy: DiningCommonsTable tests Meals Offered Today shows 'no meals offered' for 500 error
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  no meals offered
Received:


Ignored nodes: comments, script, style
