[Killed] EqualityOperator
main/pages/Meal/MealTimesPage.jsx:32:10
         <h1>
           Meals at {diningCommonsCode} for {dateTime}
         </h1>
-        {status === "loading" && <p>Loading...</p>}
+        {status !== "loading" && <p>Loading...</p>}
         {error?.response?.status === 500 && <p>No meals offered today.</p>}
         {status === "success" && (
killedBy: MealTimesPage tests displays correct information in the table
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <p>
  Loading...
</p> instead

[Killed] LogicalOperator
main/pages/Meal/MealTimesPage.jsx:32:10
         <h1>
           Meals at {diningCommonsCode} for {dateTime}
         </h1>
-        {status === "loading" && <p>Loading...</p>}
+        {status === "loading" || <p>Loading...</p>}
         {error?.response?.status === 500 && <p>No meals offered today.</p>}
         {status === "success" && (
killedBy: MealTimesPage tests displays correct information in the table
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <p>
  Loading...
</p> instead

[Killed] ConditionalExpression
main/pages/Meal/MealTimesPage.jsx:33:10
           Meals at {diningCommonsCode} for {dateTime}
         </h1>
         {status === "loading" && <p>Loading...</p>}
-        {error?.response?.status === 500 && <p>No meals offered today.</p>}
+        {false}
         {status === "success" && (
           <MealTable
killedBy: MealTimesPage tests displays 'No meals offered today.' when backend returns 500
statusReason: Unable to find an element with the text: /No meals offered today/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ConditionalExpression
main/pages/Meal/MealTimesPage.jsx:34:10
         </h1>
         {status === "loading" && <p>Loading...</p>}
         {error?.response?.status === 500 && <p>No meals offered today.</p>}
-        {status === "success" && (
-          <MealTable
-            meals={meals}
-            dateTime={dateTime}
-            diningCommonsCode={diningCommonsCode}
-          />
-        )}
+        {false}
       </div>
     </BasicLayout>
killedBy: MealTimesPage tests displays correct information in the table
statusReason: Unable to find an element with the text: Breakfast. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
