[Killed] BlockStatement
src/main/utils/useBackend.jsx:33:3
   axiosParameters,
   initialData,
   suppressToasts = false,
-) {
-  return useQuery(
-    queryKey,
-    async () => {
-      try {
-        const response = await axios(axiosParameters);
-        return response.data;
-      } catch (e) {
-        const errorMessage = `Error communicating with backend via ${axiosParameters.method} on ${axiosParameters.url}`;
-        if (!suppressToasts) {
-          toast(errorMessage);
-        }
-        console.error(errorMessage, e);
-        throw e;
-      }
-    },
-    {
-      initialData,
-    },
-  );
-}
+) {}
 
 // const wrappedParams = async (params) =>
killedBy: utils/useBackend tests utils/useBackend useBackend tests useBackend handles 404 error correctly
statusReason: Cannot read properties of undefined (reading 'isError')

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>
