[Killed] StringLiteral
main/components/DiningCommons/DiningCommonsTable.jsx:15:12
     // Stryker disable next-line all : don't test internal caching of React Query
     [`/api/diningcommons/${date}/${diningHall}`],
     {
-      url: `/api/diningcommons/${date}/${diningHall}`,
+      url: ``,
     },
     // Stryker disable next-line all : don't test default value of empty list
killedBy: DiningCommonsTable tests Meals Offered Today shows 'no meals offered' for 500 error
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  no meals offered
Received:
  An error has occured.

Ignored nodes: comments, script, style

[Killed] ConditionalExpression
main/components/DiningCommons/DiningCommonsTable.jsx:23:7
   );
 
   // Stryker disable OptionalChaining
-  if (error?.response?.status === 500) return <span>no meals offered</span>;
+  if (false) return <span>no meals offered</span>;
   if (status === "loading") return <span>Loading...</span>;
 
killedBy: DiningCommonsTable tests Meals Offered Today shows 'no meals offered' for 500 error
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  no meals offered
Received:
  An error has occured.

Ignored nodes: comments, script, style

[Killed] ConditionalExpression
main/components/DiningCommons/DiningCommonsTable.jsx:23:7
   );
 
   // Stryker disable OptionalChaining
-  if (error?.response?.status === 500) return <span>no meals offered</span>;
+  if (true) return <span>no meals offered</span>;
   if (status === "loading") return <span>Loading...</span>;
 
killedBy: DiningCommonsTable tests Meals Offered Today shows links for success
statusReason: expected 'no meals offered' to be 'Breakfast Lunch Dinner' // Object.is equality

[Killed] EqualityOperator
main/components/DiningCommons/DiningCommonsTable.jsx:24:7
 
   // Stryker disable OptionalChaining
   if (error?.response?.status === 500) return <span>no meals offered</span>;
-  if (status === "loading") return <span>Loading...</span>;
+  if (status !== "loading") return <span>Loading...</span>;
 
   if (meals) {
killedBy: DiningCommonsTable tests Meals Offered Today shows links for success
statusReason: expected 'Loading...' to be 'Breakfast Lunch Dinner' // Object.is equality

[Killed] ConditionalExpression
main/components/DiningCommons/DiningCommonsTable.jsx:24:7
 
   // Stryker disable OptionalChaining
   if (error?.response?.status === 500) return <span>no meals offered</span>;
-  if (status === "loading") return <span>Loading...</span>;
+  if (true) return <span>Loading...</span>;
 
   if (meals) {
killedBy: DiningCommonsTable tests Meals Offered Today shows links for success
statusReason: expected 'Loading...' to be 'Breakfast Lunch Dinner' // Object.is equality

[Killed] ConditionalExpression
main/components/DiningCommons/DiningCommonsTable.jsx:26:7
   if (error?.response?.status === 500) return <span>no meals offered</span>;
   if (status === "loading") return <span>Loading...</span>;
 
-  if (meals) {
+  if (true) {
     return (
       <>
killedBy: DiningCommonsTable tests Meals Offered Today shows 'no meals offered' for 500 error
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  no meals offered
Received:
  Loading...

Ignored nodes: comments, script, style

[Killed] ConditionalExpression
main/components/DiningCommons/DiningCommonsTable.jsx:31:14
       <>
         {meals.map((meal, index) => (
           <React.Fragment key={meal.code}>
-            {index > 0 && " "}
+            {true}
             <Link to={`/diningcommons/${date}/${diningHall}/${meal.code}`}>
               {meal.name}
killedBy: DiningCommonsTable tests Meals Offered Today shows links for success
statusReason: expected 'BreakfastLunchDinner' to be 'Breakfast Lunch Dinner' // Object.is equality

[Killed] StringLiteral
main/components/DiningCommons/DiningCommonsTable.jsx:31:27
       <>
         {meals.map((meal, index) => (
           <React.Fragment key={meal.code}>
-            {index > 0 && " "}
+            {index > 0 && ""}
             <Link to={`/diningcommons/${date}/${diningHall}/${meal.code}`}>
               {meal.name}
killedBy: DiningCommonsTable tests Meals Offered Today shows links for success
statusReason: expected 'BreakfastLunchDinner' to be 'Breakfast Lunch Dinner' // Object.is equality

[Killed] StringLiteral
main/components/DiningCommons/DiningCommonsTable.jsx:74:37
     {
       Header: "Has Sack Meal",
       accessor: "hasSackMeal",
-      Cell: ({ value }) => (value ? "✅" : "❌"),
+      Cell: ({ value }) => (value ? "" : "❌"),
     },
     {
killedBy: DiningCommonsTable tests Checkmark / X for Boolean columns shows up as expected, url shows up correctly
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  ✅
Received:
