[Killed] BlockStatement
src/main/utils/useBackend.jsx:36:17
 ) {
   return useQuery(
     queryKey,
-    async () => {
-      try {
-        const response = await axios(axiosParameters);
-        return response.data;
-      } catch (e) {
-        const errorMessage = `Error communicating with backend via ${axiosParameters.method} on ${axiosParameters.url}`;
-        if (!suppressToasts) {
-          toast(errorMessage);
-        }
-        console.error(errorMessage, e);
-        throw e;
-      }
-    },
+    async () => {},
     {
       initialData,
killedBy: MealTimesPage tests displays correct information in the table; HomePage tests Renders table with 4 dining commons; DiningCommonsTable tests Meals Offered Today shows 'no meals offered' for 500 error
statusReason: Cannot read properties of undefined (reading 'forEach')

[Killed] ConditionalExpression
src/main/utils/useBackend.jsx:42:13
         return response.data;
       } catch (e) {
         const errorMessage = `Error communicating with backend via ${axiosParameters.method} on ${axiosParameters.url}`;
-        if (!suppressToasts) {
+        if (true) {
           toast(errorMessage);
         }
killedBy: utils/useBackend tests useBackend handles error correctly with suppressed toast
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received: 

  1st vi.fn() call:

    Array [
      "Error communicating with backend via GET on /api/dining/all",
