[Killed] LogicalOperator
main/components/MenuItem/MenuItemTable.jsx:19:9
   };
 
   const calculateAverageRating = (reviews) => {
-    if (!reviews || !Array.isArray(reviews) || reviews.length === 0)
+    if ((!reviews || !Array.isArray(reviews)) && reviews.length === 0)
       return "No reviews";
     const validRatings = reviews
killedBy: MenuItemPage renders table correctly MenuItemPage renders 5 Menu Items Correctly; MenuItemTable Tests Renders 5 Menu Items Correctly with ratings
statusReason: Unable to find an element by: [data-testid="MenuItemTable-cell-row-0-col-name"]

Ignored nodes: comments, script, style
<body>
  <div />
</body>

Ignored nodes: comments, script, style
